Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/edc/PIC32MZ2064DAG176.PIC
      <edc:SFRDef edc:_addr="0x1F8E80BC" edc:_begin="0x80" edc:_end="0x84" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="17" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD115" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuu000000000000" edc:name="DDRCMD115" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxx000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKENCMD1" edc:mask="0x1" edc:name="CLKENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CSCMD1" edc:mask="0xff" edc:name="CSCMD1" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RASCMD1" edc:mask="0x1" edc:name="RASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CASCMD1" edc:mask="0x1" edc:name="CASCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WENCMD1" edc:mask="0x1" edc:name="WENCMD1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKENCMD2" edc:mask="0x1" edc:name="CLKENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSCMD2" edc:mask="0xff" edc:name="CSCMD2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="RASCMD2" edc:mask="0x1" edc:name="RASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CASCMD2" edc:mask="0x1" edc:name="CASCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WENCMD2" edc:mask="0x1" edc:name="WENCMD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MDALCMD" edc:mask="0xff" edc:name="MDALCMD" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80C0" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="18" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD20" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD20" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80C4" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="19" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD21" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD21" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="DDR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80C8" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="20" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD22" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD22" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80CC" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="21" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD23" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD23" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80D0" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="22" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD24" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD24" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80D4" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="23" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD25" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD25" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
